using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

/*TODO:
 * Нужно разложить n объектов, каждый весом от нуля до одного килограмма, 
 * в наименьшее количество контейнеров, максимальная емкость каждого из которых не больше одного килограмма. 
 * Используйте алгоритм "первый лучший": объекты рассматриваются в исходном порядке 
 * и каждый объект помещается в частично заполненный контейнер, 
 * в котором после помещения данного объекта  останется наименьший свободный объем. 
 * Если такого контейнера нет, то объект помещается в новый(пустой) контейнер. Время исполнения данного алгоритма O(nlogn). 
 * На входе последовательность из n весов, на выходе - количество контейнеров.
 */

namespace BinaryHeapLab
{
    class Program
    {
        static void Main(string[] args)
        {
        }
    }
}
